; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v7 - type_2 ?v4 - type_3)
 	      (pred_3 ?v2 - object ?v4 - type_3)
	      (pred_4 ?v7 - type_2 ?v8 - type_1)
	      (pred_1 ?v7 - type_2 ?v2 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v7 - type_2 ?v1 ?v5 - type_3)
       :precondition (and  (pred_2 ?v7 ?v1))
       :effect (and  (pred_2 ?v7 ?v5)
		     (not (pred_2 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v6) (pred_2 ?v7 ?v6) (pred_4 ?v7 ?v8))
       :effect (and (pred_1 ?v7 ?v3 ?v8)
		    (not (pred_3 ?v3 ?v6)) 
		    (not (pred_4 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3 ?v8) (pred_2 ?v7 ?v6))
       :effect (and (pred_3 ?v3 ?v6)
		    (pred_4 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v3 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_07 - type_2
obj_09 obj_03 obj_05 obj_04 - type_1
obj_12 obj_08 obj_02 obj_11 - type_3
obj_01 obj_06 obj_10 - object)
(:init
(pred_2 obj_13 obj_08)
(pred_4 obj_13 obj_09)
(pred_4 obj_13 obj_03)
(pred_2 obj_07 obj_02)
(pred_4 obj_07 obj_05)
(pred_4 obj_07 obj_04)
(pred_3 obj_01 obj_02)
(pred_3 obj_06 obj_11)
(pred_3 obj_10 obj_11)
)
(:goal
(and
(pred_3 obj_01 obj_08)
(pred_3 obj_06 obj_02)
(pred_3 obj_10 obj_11)
)
)

(:constraints
  (always (not (pred_2 obj_13 obj_02)))
)
)

; plan
1. (op_2 obj_13 obj_08 obj_12)
   deleted: (pred_2 obj_13 obj_08)
   added: (pred_2 obj_13 obj_12)
   goals met: 1 of 3
2. (op_3 obj_07 obj_01 obj_02 obj_04)
   deleted: (pred_3 obj_01 obj_02) (pred_4 obj_07 obj_04)
   added: (pred_1 obj_07 obj_01 obj_04)
   goals met: 1 of 3
3. (op_2 obj_07 obj_02 obj_11)
   deleted: (pred_2 obj_07 obj_02)
   added: (pred_2 obj_07 obj_11)
   goals met: 1 of 3
4. (op_3 obj_07 obj_06 obj_11 obj_05)
   deleted: (pred_3 obj_06 obj_11) (pred_4 obj_07 obj_05)
   added: (pred_1 obj_07 obj_06 obj_05)
   goals met: 1 of 3
5. (op_2 obj_07 obj_11 obj_08)
   deleted: (pred_2 obj_07 obj_11)
   added: (pred_2 obj_07 obj_08)
   goals met: 1 of 3
6. (op_1 obj_07 obj_01 obj_08 obj_04)
   deleted: (pred_1 obj_07 obj_01 obj_04)
   added: (pred_3 obj_01 obj_08) (pred_4 obj_07 obj_04)
   goals met: 2 of 3
7. (op_2 obj_07 obj_08 obj_02)
   deleted: (pred_2 obj_07 obj_08)
   added: (pred_2 obj_07 obj_02)
   goals met: 2 of 3
8. (op_1 obj_07 obj_06 obj_02 obj_05)
   deleted: (pred_1 obj_07 obj_06 obj_05)
   added: (pred_3 obj_06 obj_02) (pred_4 obj_07 obj_05)
   goals met: 3 of 3
